---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.WaterLoopData
source: html/2860db31-4947-5332-27c2-fac4caf7cc12.htm
---
# Autodesk.Revit.DB.Mechanical.WaterLoopData

Represents the data and parameters of analytical water loop.

## Syntax (C#)
```csharp
public class WaterLoopData : IDisposable
```